Repository: changch223/Tetris-Slide
Catalog: NumberClash/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hk

# BOARD_A11Y_LABEL
source: Game board, 10 by 10. Swipe in any direction to slide all blocks.
ja: ゲーム盤、10×10。任意の方向にスワイプすると全ブロックが滑ります。
zh_hans: 游戏棋盘,10 × 10。向任意方向滑动可移动全部方块。
zh_hk: 遊戲棋盤,10 × 10。向任意方向滑動可移動全部方塊。

# KEY_A11Y_SWIPE_DOWN
source: Swipe Down
ja: 下にスワイプ
zh_hans: 向下滑动
zh_hk: 向下滑動

# KEY_A11Y_SWIPE_LEFT
source: Swipe Left
ja: 左にスワイプ
zh_hans: 向左滑动
zh_hk: 向左滑動

# KEY_A11Y_SWIPE_RIGHT
source: Swipe Right
ja: 右にスワイプ
zh_hans: 向右滑动
zh_hk: 向右滑動

# KEY_A11Y_SWIPE_UP
source: Swipe Up
ja: 上にスワイプ
zh_hans: 向上滑动
zh_hk: 向上滑動

# KEY_ABOUT
source: About
ja: アプリについて
zh_hans: 关于
zh_hk: 關於

# KEY_ABOUT_BODY_1
source: A 10x10 slide-merge puzzle with block pieces of varied shapes. Swipe to slide every cell on the board, and clear horizontal rows to score.
ja: 2048 のスライド操作とさまざまな形のブロックを融合した 10×10 のパズル。スワイプすると盤面のすべてのマスが滑り、横一列をそろえると消えてスコアになります。
zh_hans: 10x10 棋盘上将 2048 的滑动玩法与各种形状的方块融合的解谜游戏。滑动一次,所有方块都会滑到尽头;横向整行被填满即可消除得分。
zh_hk: 10x10 棋盤上把 2048 的滑動操作與各種形狀的方塊融合的解謎遊戲。滑動一次,所有方塊都會滑到盡頭,橫向整列被填滿即可消除得分。

# KEY_ABOUT_BODY_2
source: Pieces appear automatically in random empty cells. The game ends when no piece can fit anymore.
ja: ピースは盤面の空いたマスに自動で出現します。どこにも置けなくなるとゲーム終了です。
zh_hans: 方块会自动落在棋盘上随机的空位。当下一个方块在所有旋转下都无法放入时,游戏结束。
zh_hk: 方塊會自動落在棋盤上隨機的空位。當下一個方塊在所有旋轉下都無法放入時,遊戲結束。

# KEY_ABOUT_CREDITS
source: © 2026. Independently designed and developed.
ja: © 2026. 個人によるデザイン・開発。
zh_hans: © 2026. 独立设计与开发。
zh_hk: © 2026. 獨立設計與開發。

# KEY_ABOUT_TITLE
source: Block Slide
ja: ブロックスライド
zh_hans: 方块滑动
zh_hk: 方塊滑動

# KEY_APP_TAGLINE
source: Slide blocks. Clear lines. Beat your high score.
ja: ブロックを滑らせ、ラインを消して、ハイスコアを更新。
zh_hans: 滑动方块,消除整行,挑战最高分。
zh_hk: 滑動方塊、消除整列、挑戰最高分。

# KEY_APP_TITLE
source: Block Slide
ja: ブロックスライド
zh_hans: 方块滑动
zh_hk: 方塊滑動

# KEY_GAMEOVER_TITLE
source: GAME OVER
ja: ゲームオーバー
zh_hans: 游戏结束
zh_hk: 遊戲結束

# KEY_HUD_HIGH_SCORE
source: HIGH
ja: 最高
zh_hans: 最高
zh_hk: 最高

# KEY_HUD_SCORE
source: SCORE
ja: スコア
zh_hans: 得分
zh_hk: 分數

# KEY_MAIN_MENU
source: Menu
ja: メニュー
zh_hans: 菜单
zh_hk: 選單

# KEY_NEW_HIGH_SCORE
source: ★ NEW HIGH SCORE ★
ja: ★ ハイスコア更新 ★
zh_hans: ★ 新纪录 ★
zh_hk: ★ 最佳紀錄 ★

# KEY_NEXT
source: NEXT
ja: ネクスト
zh_hans: 下一个
zh_hk: 下一個

# KEY_PLAY
source: PLAY
ja: プレイ
zh_hans: 开始
zh_hk: 開始

# KEY_PLAY_AGAIN
source: Play Again
ja: もう一度プレイ
zh_hans: 再玩一局
zh_hk: 再玩一局

# KEY_ROTATE
source: Rotate
ja: 回転
zh_hans: 旋转
zh_hk: 旋轉

# KEY_SETTINGS
source: Settings
ja: 設定
zh_hans: 设置
zh_hk: 設定

# KEY_SETTINGS_FEEDBACK_HEADER
source: Feedback
ja: フィードバック
zh_hans: 反馈
zh_hk: 回饋

# KEY_SETTINGS_HAPTICS
source: Haptics
ja: 触覚フィードバック
zh_hans: 震动
zh_hk: 震動

# KEY_SETTINGS_SOUND
source: Sound
ja: サウンド
zh_hans: 音效
zh_hk: 音效
